## Pair Programming Limieza IV
### Modulo 2 Sprint 2
#### Lola Rubio y Judith Mellidez

En este caso trabajaremos con el dataframe que limpiamos en el ejercicio de pair de Limpieza anterior, el de Limpieza III, donde limpiabamos las columnas de species, age, etc. y eliminabamos los outliers.

- ¬øEs Australia es el sitio m√°s peligroso y letal para estar relajada en la playa?
- ¬øCu√°l es el rango de edad que sufre la mayor√≠a de los ataques?
- Independientemente de la edad, sufren los hombres m√°s ataques que las mujeres?
- ¬øEn qu√© mes ocurren m√°s ataques?
- ¬øCu√°l es la relaci√≥n entre la especie y el tipo de ataque (si es fatal o no)?
- ¬øC√≥mo han evolucionado los ataques a lo largo del tiempo?
De todo esto, nos damos cuenta que solo tenemos que limpiar algunas de las columnas, en concreto age, species, country, fatal, year, sex. Si reducimos esto a una tabla para saber que tenemos ya limpito y que no. **Actualizamos esta tabla ya que en el ejercicio de pair de Limpieza I ya dejamos algunas columnas limpitas:

Es el momento de ponernos a trabajar con los valores nulos üí™üèΩ. A lo largo de este ejercicio de pair programming vamos a intentar eliminar los valores nulos de nuestras columnas. En la lecci√≥n hemos aprendido varios m√©todos, nosotras os planteamos los ejercicios pero sentiros libres de usar el m√©todo que m√°s se adapte a vuestras necesidades. Manos a la obra!

In [23]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')
import sidetable

In [29]:
df= pd.read_csv('attacks_limpieza3.csv', index_col=0)
df.head(2)

,case_number,year,type,country,age,species_,month,fatal,sex,species_shark,edad_ataques
0,1800.00.00,1975.0,Unprovoked,seychelles,NaN,NaN,NaN,Y,F,Unspecified,NaN
1,1797.05.28.R,1975.0,Unprovoked,NaN,NaN,NaN,May,Y,NaN,Unspecified,NaN

#### 1. Lo primero que tenemos que evaluar es en que columnas tenemos nulos y que cantidad tenemos en cada una. ¬øHay alguna columna con una gran cantidad de nulos? En caso de que sea as√≠ deberemos eliminarla.

In [5]:
#Decidimos no eliminar ninguna columna dado que verificamos que no tenemos un porcentaje alto de nulos.
df.stb.missing()

               missing  total    percent
age                177   1672  10.586124
edad_ataques       177   1672  10.586124
month              154   1672   9.210526
species_           126   1672   7.535885
fatal               96   1672   5.741627
sex                 15   1672   0.897129
country             10   1672   0.598086
case_number          0   1672   0.000000
year                 0   1672   0.000000
type                 0   1672   0.000000
species_shark        0   1672   0.000000

#### 2. Es el momento de eliminar los nulos:

- Reemplazad los valores nulos de la columna age por la media de la edad, redondeada a dos decimales.

In [11]:
df['age'].mean()

27.983799147077182

In [8]:
df['age'].fillna(round(df['age'].mean(),2), inplace=True)

In [10]:
df['age'].unique()

array([27.98    , 14.      , 19.      , 20.      , 15.      , 21.      ,
       27.      , 36.      , 25.      ,  6.      , 16.      , 50.      ,
       57.      , 18.      , 32.      , 30.      , 60.      , 33.      ,
       10.      , 28.709699, 55.      , 35.      , 54.      , 22.      ,
       31.      , 40.      , 37.      , 11.      , 13.      , 34.      ,
       46.      , 48.      , 17.      , 28.      , 65.      , 58.      ,
       51.      , 61.      , 59.      , 42.      , 23.      , 29.      ,
       39.      , 24.      , 12.      , 26.      , 43.      ,  9.      ,
       44.      , 62.      , 52.      , 38.      , 47.      , 63.      ,
       41.      , 53.      ,  7.      , 45.      , 64.      ,  8.      ,
       56.      , 49.      ,  5.      ])

- En relaci√≥n a la columna de country al tratarse de una columna de tipo categ√≥rica, reemplazad los valores nulos por una nueva categ√≥ria que se llame Unknown.

In [17]:
df['country'].replace(np.nan, 'unknown', inplace=True)
df

,case_number,year,type,country,age,species_,month,fatal,sex,species_shark,edad_ataques
0,1800.00.00,1975.000000,Unprovoked,seychelles,27.98,NaN,NaN,Y,F,Unspecified,NaN
1,1797.05.28.R,1975.000000,Unprovoked,unknon,27.98,NaN,May,Y,NaN,Unspecified,NaN
2,1792.09.12,1975.000000,Provoked,england,27.98,NaN,Sep,Y,M,Unspecified,NaN
3,1791.00.00,1975.000000,Unprovoked,australia,27.98,NaN,NaN,Y,F,Unspecified,NaN
4,1788.05.10,1975.000000,Boat,australia,27.98,NaN,May,N,NaN,Unspecified,NaN
...,...,...,...,...,...,...,...,...,...,...,...
1667,1901.07.30,1990.135167,Unprovoked,south africa,29.00,White shark,Jul,Y,M,White,joven
1668,1894.11.28,1975.000000,Unprovoked,australia,19.00,10' to 12' shark,Nov,N,M,Unspecified,joven
1669,1892.03.02,1975.000000,Provoked,australia,21.00,12' shark,Mar,N,M,Unspecified,joven
1670,1880.11.25,1975.000000,Unprovoked,australia,12.00,Bull shark,Nov,Y,M,Bull,joven
1671,1868.05.13,1975.000000,Unprovoked,india,35.00,Identified as C. gangeticus by Dr. J. Fayrer,May,Y,M,Unspecified,adulto

- Reemplazad los valores nulos de la columna fatal por Unknown.

In [18]:
df['fatal'].replace(np.nan, 'unknown', inplace=True)
df

,case_number,year,type,country,age,species_,month,fatal,sex,species_shark,edad_ataques
0,1800.00.00,1975.000000,Unprovoked,seychelles,27.98,NaN,NaN,Y,F,Unspecified,NaN
1,1797.05.28.R,1975.000000,Unprovoked,unknon,27.98,NaN,May,Y,NaN,Unspecified,NaN
2,1792.09.12,1975.000000,Provoked,england,27.98,NaN,Sep,Y,M,Unspecified,NaN
3,1791.00.00,1975.000000,Unprovoked,australia,27.98,NaN,NaN,Y,F,Unspecified,NaN
4,1788.05.10,1975.000000,Boat,australia,27.98,NaN,May,N,NaN,Unspecified,NaN
...,...,...,...,...,...,...,...,...,...,...,...
1667,1901.07.30,1990.135167,Unprovoked,south africa,29.00,White shark,Jul,Y,M,White,joven
1668,1894.11.28,1975.000000,Unprovoked,australia,19.00,10' to 12' shark,Nov,N,M,Unspecified,joven
1669,1892.03.02,1975.000000,Provoked,australia,21.00,12' shark,Mar,N,M,Unspecified,joven
1670,1880.11.25,1975.000000,Unprovoked,australia,12.00,Bull shark,Nov,Y,M,Bull,joven
1671,1868.05.13,1975.000000,Unprovoked,india,35.00,Identified as C. gangeticus by Dr. J. Fayrer,May,Y,M,Unspecified,adulto

In [19]:
df['fatal'].unique()

array(['Y', 'N', 'unknown'], dtype=object)

- Reemplazad los valores nulos de la columna type por el valor m√°s frecuente (la moda).

In [27]:
df.stb.missing()

               missing  total    percent
age                177   1672  10.586124
edad_ataques       177   1672  10.586124
month              154   1672   9.210526
species_           126   1672   7.535885
fatal               96   1672   5.741627
sex                 15   1672   0.897129
country             10   1672   0.598086
case_number          0   1672   0.000000
year                 0   1672   0.000000
type                 0   1672   0.000000
species_shark        0   1672   0.000000

In [21]:
df['type'].unique()

array(['Unprovoked', 'Provoked', 'Boat', 'Sea Disaster', 'Invalid',
       'Boating'], dtype=object)

In [25]:
df['type'].fillna(df['type'].mode()[0],inplace=True)

In [26]:
df['type'].unique()

array(['Unprovoked', 'Provoked', 'Boat', 'Sea Disaster', 'Invalid',
       'Boating'], dtype=object)

Antes de utilizar el metodo de reemplazo de nulos en la columna 'type'hacemos un .unique() para verlos valores unicos de la columna y observamos que no hay ningun nulo por lo que no he

- Reemplazad los valores nulos de la columna fecha por Unknown.

In [30]:
df['month'].unique()

array([nan, 'May', 'Sep', 'Jul', 'Aug', 'Dec', 'Mar', 'Oct', 'Apr', 'Jan',
       'Jun', 'Feb', 'Nov'], dtype=object)

In [32]:
df['month'].replace(np.nan, 'unknown', inplace=True)
df.head()

,case_number,year,type,country,age,species_,month,fatal,sex,species_shark,edad_ataques
0,1800.00.00,1975.0,Unprovoked,seychelles,NaN,NaN,unknown,Y,F,Unspecified,NaN
1,1797.05.28.R,1975.0,Unprovoked,NaN,NaN,NaN,May,Y,NaN,Unspecified,NaN
2,1792.09.12,1975.0,Provoked,england,NaN,NaN,Sep,Y,M,Unspecified,NaN
3,1791.00.00,1975.0,Unprovoked,australia,NaN,NaN,unknown,Y,F,Unspecified,NaN
4,1788.05.10,1975.0,Boat,australia,NaN,NaN,May,N,NaN,Unspecified,NaN

In [33]:
df['month'].unique()

array(['unknown', 'May', 'Sep', 'Jul', 'Aug', 'Dec', 'Mar', 'Oct', 'Apr',
       'Jan', 'Jun', 'Feb', 'Nov'], dtype=object)

#### 3. Guardad el csv para seguir trabajando con el en los siguientes ejercicios de pair.

In [34]:
df.to_csv('attacks_limpieza4.csv')